package com.shandagames.android.constant;

import java.io.File;

import android.os.Environment;

/**
 * @file Constants.java
 * @create 2012-10-9 上午9:54:22
 * @author lilong
 * @description TODO 应用存储常量
 */
public final class Constants {

	private Constants() {
	}
	
	public static final String APP_NAME = "project";
	
	// TODO Turn off when deploying your app.
	public static final boolean DEVELOPER_MODE = true;
	public static final boolean SUPPORT_CACHE = true;
	public static final boolean LOCATION_DEBUG = DEVELOPER_MODE;
	
	public static final String DEBUG_SERVER = "www.gameplus.com/test";
	public static final String RELEASE_SERVER = "www.gameplus.com/release";
	
	public static final File SDCARD_ROOT = Environment.getExternalStorageDirectory();
	public static final File CAMERA_IMAGE_BUCKET_DIR = new File(SDCARD_ROOT, "DCIM/Camera");
	public static final File BASE_DIR = new File(SDCARD_ROOT, APP_NAME); 
	
	public static final String TEMP_DIR 	=	"temp";
	public static final String CACHE_DIR 	= 	"cache";
	public static final String DATA_DIR 	= 	"cache/data";
	public static final String AUDIO_DIR 	= 	"cache/audio";
	public static final String AVATAR_DIR	= 	"cache/avatar";
	public static final String PHOTO_DIR 	= 	"cache/photo";
	
	
	/*#########################################################################################################################################################*/
	
	public static final String[] MONTHS_EN = new String[] {"January", "February", "March", "April", "May", "June", "July", "August", "September", "October", "November", "December"};
	
	public static final String[] MONTHS_CN = new String[] {"一月","二月","三月","四月","五月","六月","七月","八月","九月","十月","十一月","十二月"};
	
	public static final String[] PROVINCES = new String[] {"北京","上海","天津","河北","山西","内蒙古","辽宁","吉林","黑龙江","江苏","浙江","安徽","福建","江西","山东","河南","湖北","湖南","广东","广西","海南","重庆","四川","贵州","云南","西藏","陕西","甘肃","青海","宁夏","新疆","香港","澳门","台湾","其它"};;
	
	public static final String CITIES[][] = new String[][]{
		new String[]{"东城", "西城", "朝阳", "丰台", "石景山", "海淀", "门头沟", "房山", "通州", "顺义", "昌平", "大兴", "怀柔", "平谷", "密云", "延庆"},
		new String[]{"黄浦", "徐汇", "长宁", "静安", "普陀", "闸北", "虹口", "杨浦", "闵行", "宝山", "嘉定", "浦东新区", "金山", "松江", "青浦", "奉贤", "崇明"},
		new String[]{"和平", "河东", "河西", "南开", "河北", "红桥", "东丽", "西青", "津南", "北辰", "武清", "宝坻", "滨海新区", "宁河", "静海", "蓟县"},
		new String[]{"石家庄", "唐山", "秦皇岛", "邯郸", "邢台", "保定", "张家口", "承德", "沧州", "廊坊", "衡水"},
		new String[]{"太原", "大同", "阳泉", "长治", "晋城", "朔州", "晋中", "运城", "忻州", "临汾", "吕梁"},
		new String[]{"呼和浩特", "包头", "乌海", "赤峰", "通辽", "鄂尔多斯", "呼伦贝尔", "巴彦淖尔", "乌兰察布", "兴安", "锡林郭勒", "阿拉善"},
		new String[]{"沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州", "营口", "阜新", "辽阳", "盘锦", "铁岭", "朝阳", "葫芦岛"},
		new String[]{"长春", "吉林", "四平", "辽源", "通化", "白山", "松原", "白城", "延边"},
		new String[]{"哈尔滨", "齐齐哈尔", "鸡西", "鹤岗", "双鸭山", "大庆", "伊春", "佳木斯", "七台河", "牡丹江", "黑河", "绥化", "大兴安岭"},
		new String[]{"南京", "无锡", "徐州", "常州", "苏州", "南通", "连云港", "淮安", "盐城", "扬州", "镇江", "泰州", "宿迁"},
		new String[]{"杭州", "宁波", "温州", "嘉兴", "湖州", "绍兴", "金华", "衢州", "舟山", "台州", "丽水"},
		new String[]{"合肥", "芜湖", "蚌埠", "淮南", "马鞍山", "淮北", "铜陵", "安庆", "黄山", "滁州", "阜阳", "宿州", "六安", "亳州", "池州", "宣城"},
		new String[]{"福州", "厦门", "莆田", "三明", "泉州", "漳州", "南平", "龙岩", "宁德"},
		new String[]{"南昌", "景德镇", "萍乡", "九江", "新余", "鹰潭", "赣州", "吉安", "宜春", "抚州", "上饶"},
		new String[]{"济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊", "济宁", "泰安", "威海", "日照", "莱芜", "临沂", "德州", "聊城", "滨州", "菏泽"},
		new String[]{"郑州", "开封", "洛阳", "平顶山", "安阳", "鹤壁", "新乡", "焦作", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘", "信阳", "周口", "驻马店", "济源"},
		new String[]{"武汉", "黄石", "十堰", "宜昌", "襄阳", "鄂州", "荆门", "孝感", "荆州", "黄冈", "咸宁", "随州", "恩施", "仙桃", "潜江", "天门", "神农架"},
		new String[]{"长沙", "株洲", "湘潭", "衡阳", "邵阳", "岳阳", "常德", "张家界", "益阳", "郴州", "永州", "怀化", "娄底", "湘西"},
		new String[]{"广州", "韶关", "深圳", "珠海", "汕头", "佛山", "江门", "湛江", "茂名", "肇庆", "惠州", "梅州", "汕尾", "河源", "阳江", "清远", "东莞", "中山", "潮州", "揭阳", "云浮"},
		new String[]{"南宁", "柳州", "桂林", "梧州", "北海", "防城港", "钦州", "贵港", "玉林", "百色", "贺州", "河池", "来宾", "崇左"},
		new String[]{"海口", "三亚", "五指山", "琼海市", "儋州市", "文昌市", "万宁市", "东方市", "定安县", "屯昌县", "澄迈", "临高", "白沙", "昌江", "乐东", "陵水", "保亭", "琼中", "西沙", "南沙", "中沙"},
		new String[]{"万州", "涪陵", "渝中", "大渡口", "江北", "沙坪坝", "九龙坡", "南岸", "北碚", "綦江", "大足", "渝北", "巴南", "黔江", "长寿", "江津", "合川", "永川", "南川", "潼南", "铜梁", "荣昌", "璧山", "梁平", "城口", "丰都", "垫江", "武隆", "忠县", "开县", "云阳", "奉节", "巫山", "巫溪", "石柱", "秀山", "酉阳", "彭水"},
		new String[]{"成都", "自贡", "攀枝花", "泸州", "德阳", "绵阳", "广元", "遂宁", "内江", "乐山", "南充", "眉山", "宜宾", "广安", "达州", "雅安", "巴中", "资阳", "阿坝", "甘孜", "凉山"},
		new String[]{"贵阳", "六盘水", "遵义", "安顺", "毕节", "铜仁", "黔西", "黔东", "黔南"},
		new String[]{"昆明", "曲靖", "玉溪", "保山", "昭通", "丽江", "普洱", "临沧", "楚雄", "红河", "文山", "西双版纳", "大理", "德宏", "怒江", "迪庆"},
		new String[]{"拉萨", "昌都", "山南", "日喀则", "那曲", "阿里", "林芝"},
		new String[]{"西安", "铜川", "宝鸡", "咸阳", "渭南", "延安", "汉中", "榆林", "安康", "商洛"},
		new String[]{"兰州", "嘉峪关", "金昌", "白银", "天水", "武威", "张掖", "平凉", "酒泉", "庆阳", "定西", "陇南", "临夏", "甘南"},
		new String[]{"西宁", "海东", "海北", "黄南", "海南", "果洛", "玉树", "海西"},
		new String[]{"银川", "石嘴山", "吴忠", "固原", "中卫"},
		new String[]{"乌鲁木齐", "克拉玛依", "吐鲁番", "哈密", "昌吉", "博尔塔拉", "巴音郭楞", "阿克苏", "克孜勒苏", "喀什", "和田", "伊犁", "塔城", "阿勒泰"},
		new String[]{"中西", "东区", "九龙", "观塘", "南区", "深水埗", "黄大仙", "湾仔", "油尖旺", "离岛", "北区", "西贡", "沙田", "大埔", "荃湾", "元朗"},
		new String[]{"花地玛堂", "圣安多尼堂", "大堂", "望德堂", "风顺堂", "氹仔", "路环"},
		new String[]{"台北", "高雄", "台中", "台南", "基隆", "新竹", "嘉义", "宜兰", "桃园", "苗栗", "彰化", "南投", "云林", "屏东", "台东", "花莲", "澎湖"},
		new String[]{"其它"}};
	
	/*#########################################################################################################################################################*/
	
	
}
